[
    {
      "id": "nova-strategy",
      "title": "Nova Strategy",
      "category": "Digital Agency",
      "image": "https://images.unsplash.com/photo-1556761175-5973dc0f32e7?q=80&w=1000",
      "shortDescription": "Clean, trust-focused portfolio for B2B & corporate clients.",
      "fullDescription": "A 7-page 'Clean Corporate' website designed for high-end B2B clients in Bangladesh. It features a transparent pricing model, a project cost estimator, and a formal 'Company Profile' page, utilizing a 'Trust Blue & Slate Gray' palette to signal stability.",
      "liveLink": "https://twtech-hub.github.io/NOVA.-Digital-Marketing-D5/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "Google Maps API"
      ],
      "features": [
        "Project Cost Estimator",
        "Sticky Service Navigation",
        "Before/After Case Study Slider",
        "Detailed Service Accordions"
      ],
      "designUnique": "Adopted a 'Clarity & Growth' philosophy with generous whitespace, the Plus Jakarta Sans typeface, and a restrained color palette to appeal to corporate decision-makers (Banks, Real Estate, FMCG).",
      "developmentProcess": "Built a custom tab-switching logic for the services page and a dynamic budget calculator in vanilla JS to provide immediate value to potential leads without page reloads."
    },
    {
  "id": "elevate-global",
  "title": "Elevate Global",
  "category": "Education Consultancy",
  "image": "https://images.unsplash.com/photo-1541339907198-e08756dedf3f?q=80&w=1600",
  "shortDescription": "Executive dark-mode portfolio for premium education consultancy.",
  "fullDescription": "A 7-page 'Private Banking' style website designed for the affluent education market in Bangladesh. It features a 'Slate & Gold' aesthetic, sophisticated serif typography, and a high-touch user experience. The site emphasizes exclusivity, financial precision ('Financial Forensics'), and end-to-end concierge services for students targeting Ivy League and Russell Group universities.",
  "liveLink": "https://twtech-hub.github.io/ELEVATE-Global-Educantion-Consultancy-D7/",
  "techStack": [
    "HTML5",
    "Tailwind CSS",
    "JavaScript",
    "Gold Gradients"
  ],
  "features": [
    "Multi-Step Profile Assessment Wizard",
    "University Curator with Prestige Filters",
    "Financial Planning Tools for Visas",
    "Cinematic Success Story Gallery"
  ],
  "designUnique": "Abandons the typical 'colorful/friendly' student vibe for a serious, high-contrast 'Executive' look that appeals to parents making significant financial investments.",
  "developmentProcess": "Implemented a custom multi-step form logic with validation and a 'Vault' concept for data privacy to build trust with high-net-worth clients."
},
    {
  "id": "astra-overseas",
  "title": "Astra Overseas",
  "category": "Education Consultancy",
  "image": "https://images.unsplash.com/photo-1516321318423-f06f85e504b3?q=80&w=1600",
  "shortDescription": "Dark-mode, futuristic consultancy portfolio for elite students.",
  "fullDescription": "A 7-page 'Premium Dark Mode' website designed for the high-end education market in Bangladesh. It features a 'Deep Space' aesthetic with neon cyan/purple accents, glassmorphism, and holographic UI elements. The site positions the agency as a 'Career Architect' rather than a simple file processor, utilizing advanced features like a 'Visa Lab' financial audit showcase and an AI-styled eligibility wizard.",
  "liveLink": "https://twtech-hub.github.io/Astra-Overseas-Education-Consultancy-D6/",
  "techStack": [
    "HTML5",
    "Tailwind CSS",
    "JavaScript",
    "Glassmorphism"
  ],
  "features": [
    "Holographic University Finder",
    "AI-Styled Profile Assessment Wizard",
    "Neon Event Countdown & Registration",
    "Cinematic Video Testimonial Grid"
  ],
  "designUnique": "Breaks the mold of traditional 'blue/white' education sites by adopting a 'Cyberpunk/Fintech' look that appeals to ambitious, tech-savvy Gen Z students and affluent parents.",
  "developmentProcess": "Implemented complex CSS animations for 'glowing' borders and 'floating' cards, along with a vanilla JS multi-step form logic that simulates a system data processing interface."
},
    {
  "id": "pathway-global",
  "title": "Pathway Global",
  "category": "Education Consultancy",
  "image": "https://images.unsplash.com/photo-1523240795612-9a054b0db644?q=80&w=1600",
  "shortDescription": "Vibrant, student-centric portfolio for a study abroad agency.",
  "fullDescription": "A 7-page 'EdTech Lifestyle' website designed to convert students into applicants. It features a high-energy Teal & Orange palette, a 'University Finder' search engine, and a gamified 'Free Assessment' wizard. The design focuses on social proof through a 'Visa Gallery' and video testimonials, addressing specific local needs like IELTS waivers and study gap acceptance.",
  "liveLink": "https://twtech-hub.github.io/Pathway-Euducation-Consultancy-D5/",
  "techStack": [
    "HTML5",
    "Tailwind CSS",
    "JavaScript",
    "Multi-Step Forms"
  ],
  "features": [
    "University Search Engine with Filters",
    "Gamified Eligibility Assessment Wizard",
    "Interactive World Map for Destinations",
    "Visual Visa Gallery & Video Modals"
  ],
  "designUnique": "Uses a 'Launchpad' aesthetic with pill-shaped buttons, card-based layouts, and cheerful typography to reduce the stress of the application process for Gen Z users.",
  "developmentProcess": "Built a custom multi-step form handler in vanilla JS to guide users through the assessment process, increasing lead quality by gathering detailed profile data before submission."
},
    {
  "id": "empire-legal-v1",
  "title": "Empire Legal: Advocates & Solicitors",
  "category": "Law Firm",
  "image": "https://images.unsplash.com/photo-1589829545856-d10d557cf95f?q=80&w=2070",
  "shortDescription": "A 'Sovereign Red & Ivory' high-end digital headquarters for Bangladesh's top-tier legal practitioners.",
  "fullDescription": "Empire Legal is a benchmark 8-page digital ecosystem designed for the elite echelon of the Bangladeshi legal market. Moving away from standard minimalist or dark themes, this project utilizes a 'Sovereign Red & Ivory' palette to signal institutional history, unyielding authority, and transparency. The site functions as a comprehensive operational hub, featuring a multi-step appointment engine that pre-vetts cases, an interactive Reported Judgment archive with procedural strategy breakdowns, and a live-searchable legislative repository. Built on a zero-dependency pure Vanilla stack (HTML5/Tailwind/JS), it achieves extreme performance scores on local mobile networks while providing high-resolution visual polish. From the forensic case-merit calculator to the sepia-toned interactive HQ mapping, every element is meticulously engineered to position the firm as the primary sovereign authority for Multinational Corporations and High-Net-Worth Individuals.",
  "liveLink": "https://twtech-hub.github.io/Empire-Chamber-D9/",
  "techStack": [
    "HTML5 (Semantic & Institutional)",
    "Tailwind CSS (High-End Light Theme)",
    "Vanilla JavaScript (Form Logic & Interaction)",
    "Font Awesome 6 (Iconography)",
    "Google Maps API (Grayscale Logic)"
  ],
  "features": [
    "Algorithmic Case-Merit Tool: A custom-built calculator that provides an immediate diagnostic percentage for legal standing based on area and evidence readiness.",
    "Smart Multi-Step Booking Engine: A dynamic form that toggles fields for corporate vs. individual needs, ensuring high pre-consultation lead quality.",
    "Reported Judgment Archive: An interactive accordion-based vault breaking down complex High Court wins into 'Challenge' vs. 'Tactical Strategy'.",
    "Live Intel Repository: A real-time client-side search engine for legal articles, allowing users to find specific gazetted updates (e.g., Bank Company Act).",
    "Emergency Defense Ribbon: A high-visibility, persistent UI element providing one-touch access to a 24/7 criminal defense and bail hotline."
  ],
  "designUnique": "The design follows a 'Institutional Mastery' philosophy. We abandoned standard blue/white law templates for a warm 'Ivory White' background punctuated by 'Sovereign Red' (#991b1b) accents. This combination projects expensive, historic authority without the coldness of dark themes. Custom grayscale-to-color image transitions and 'Cinzel' serif typography evoke a sense of European scholarly rigor applied to the Bangladeshi legal context.",
  "developmentProcess": "Developed using a 'Modular Component' approach in pure Vanilla JS. We engineered custom logic for the multi-step intake form and the post-filtering search engine to maintain a lightweight footprint (under 14KB JS). The layout was specifically stress-tested for 'Dhaka Traffic Readability'—ensuring large touch targets and high-contrast text for clients accessing legal updates while in transit."
},
    {
  "id": "titan-legal-v1",
  "title": "TITAN LEGAL: Barristers & Advocates",
  "category": "Legal Firm",
  "image": "https://images.unsplash.com/photo-1486406146926-c627a92ad1ab?q=80&w=2070",
  "shortDescription": "A powerful 'Crimson & Steel' themed digital presence for Bangladesh's top-tier legal chambers.",
  "fullDescription": "TITAN LEGAL is an 8-page, 100+ section digital ecosystem engineered for the elite echelon of the Bangladeshi legal market. Moving away from standard minimalist designs, this project utilizes a 'Corporate Power' aesthetic—combining Deep Navy and Cardinal Red—to project absolute authority, urgency, and institutional history. The site functions as a virtual command center, featuring a multi-path appointment engine for individual and corporate entities, a high-impact case results archive with procedural strategy breakdowns, and a live-searchable legal intelligence library. Built on a pure Vanilla stack (HTML5/Tailwind/JS), it ensures zero-latency performance on local 4G networks while maintaining military-grade visual polish. Every interaction, from the marquee hiring ribbons to the sepia-toned interactive maps, is meticulously crafted to signal that this is the firm corporations hire when they cannot afford to lose.",
  "liveLink": "https://twtech-hub.github.io/Titan-Legal-Chamber-D8/",
  "techStack": [
    "HTML5 (Semantic & Institutional)",
    "Tailwind CSS (High-Contrast Theme)",
    "Vanilla JavaScript (Logic & Interactivity)",
    "Font Awesome 6 (Iconography)",
    "Google Maps API (Sepia Tactical Integration)"
  ],
  "features": [
    "Smart Multi-Path Booking Engine: Dynamically toggles fields for Individual vs. Corporate clients to maximize intake conversion rates.",
    "Procedural Verdict Archive: An interactive 'Verdicts' page that breaks complex judgments into 'Challenge' vs. 'Strategy' accordions for evidence-based trust.",
    "Live Intel Hub: A real-time client-side search engine for the legal blog, allowing stakeholders to instantly find analyses of specific Acts (e.g., Bank Company Act).",
    "Emergency Rapid Response Banner: A persistent, high-visibility UI element providing 24/7 access to urgent criminal defense and bail support.",
    "Dynamic Bio-Modal System: An immersive overlay for attorney profiles that highlights academic pedigree and Supreme Court seniority without page reloads."
  ],
  "designUnique": "The design philosophy is 'Institutional Aggression.' We abandoned the common blue/white law firm template for a 'Crimson & Steel' palette. Cardinal Red (#b91c1c) is used as a tactical accent to guide the user's eye to high-conversion actions, while 'Oswald' typography provides a bold, newspaper-like authority. New, high-resolution grayscale imagery was curated to contrast against the red accents, creating a high-stakes, cinematic legal atmosphere.",
  "developmentProcess": "Developed using a 'Modular Vanilla' architecture. We built custom JavaScript modules for the filtering systems and form logic to maintain a lightweight footprint (under 12KB JS). The layout was stress-tested for mobile responsiveness in the Dhaka High Court vicinity, ensuring rapid document access despite local network throttling. Semantic HTML5 ensures 95+ scores on SEO and accessibility audits."
},
    {
      "id": "justice-chambers",
      "title": "Justice Chambers",
      "category": "Law Firm",
      "image": "https://images.unsplash.com/photo-1589829085413-56de8ae18c73?q=80&w=1600",
      "shortDescription": "Prestigious, authoritative portfolio for a top-tier law firm.",
      "fullDescription": "A 7-page 'Gilded Slate' website designed for a premier Bangladeshi law firm. It communicates authority through a Deep Navy & Gold palette, Serif typography, and specific features like a 'Case Verdict Archive', 'Attorney Profiles' with modal bios, and a downloadable 'Legal Resource' center.",
      "liveLink": "https://twtech-hub.github.io/Justice-Chamber-D1/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "ScrollSpy Navigation"
      ],
      "features": [
        "Vertical History Timeline",
        "Sticky Sidebar for Practice Areas",
        "Verdict Archive with Filters",
        "Downloadable Legal Forms Logic"
      ],
      "designUnique": "Utilizes a 'Gilded Slate' aesthetic with Playfair Display (Serif) fonts and Gold accents to evoke a sense of history, trust, and elite capability suitable for High Court advocates.",
      "developmentProcess": "Implemented a vanilla JS intersection observer for the history timeline animation and a sticky sidebar scroll-spy to handle dense legal information easily."
    },
    {
      "id": "legal-nexus-bd",
      "title": "Legal Nexus & Associates",
      "category": "Law Firm",
      "image": "https://images.unsplash.com/photo-1589829545856-d10d557cf95f?q=80&w=1000",
      "shortDescription": "A prestigious, high-conversion digital headquarters for a top-tier Bangladeshi Law Chamber.",
      "fullDescription": "Legal Nexus is a comprehensive 9-page digital ecosystem engineered specifically for the Bangladeshi legal landscape. Recognizing that trust is the primary currency in law, the site utilizes a 'Trust Blue & Slate Gray' palette, reinforced by professional gold accents to signify authority. The architecture includes specialized pages for 'Practice Areas', 'Land Dispute Expertise', 'Corporate Law', and a dedicated 'Supreme Court Case Tracker' interface. To drive conversions, we integrated a custom-built Vanilla JS 'Legal Fee Estimator' and an interactive 'Consultation Booking System'. The design balances the gravity of legal services with modern UI trends, ensuring a seamless experience for both local corporate entities and international clients seeking legal representation in Bangladesh.",
      "liveLink": "https://twtech-hub.github.io/Lex.Corp-Legal-Chamber-D2/",
      "techStack": [
        "HTML5 (Semantic)",
        "Tailwind CSS (JIT)",
        "Vanilla JavaScript (ES6+)",
        "Lucide Icons",
        "AOS (Animate On Scroll) Library"
      ],
      "features": [
        "Dynamic Legal Fee Estimator: A JS-powered tool to give clients instant ballpark figures.",
        "Integrated Appointment Scheduler: A multi-step functional form with real-time validation.",
        "Practice Area Accordions: Clean, space-saving data organization for complex legal services.",
        "Interactive Case Study Timeline: Showcasing the firm's history of successful litigation.",
        "Responsive Multi-level Navigation: Optimized for the high mobile-user density in Bangladesh.",
        "Bilingual Support Ready: Structured to easily toggle between English and Bengali legal terms."
      ],
      "designUnique": "The 'Seal of Trust' philosophy was applied, utilizing high-density whitespace and a structured grid system. We selected the Plus Jakarta Sans typeface for its modern yet formal readability. The color psychology focuses on Deep Navy to establish immediate credibility, paired with Slate Gray for a sophisticated corporate feel, catering specifically to the decision-making process of Bangladeshi MDs and CEOs.",
      "developmentProcess": "The development followed a modular 'Component-First' approach in Vanilla JS. We engineered a custom state-management script for the multi-section services page, allowing users to filter practice areas without a single page reload. Every interactive element, from the sticky header logic to the complex footer mapping, was hand-coded to ensure 0% bug rates and lightning-fast load times on 4G networks common in Bangladesh."
    },
    {
      "id": "vertex-chambers",
      "title": "Vertex Chambers & Partners",
      "category": "Law Firm",
      "image": "https://images.unsplash.com/photo-1589829085413-56de8ae18c73?q=80&w=2070",
      "shortDescription": "A sovereign, authoritative digital presence for a top-tier Bangladeshi law firm.",
      "fullDescription": "Vertex Chambers is an 8-page, high-density website engineered to establish immediate institutional trust. Moving away from generic corporate designs, this project adopts a 'Justice Navy & Sovereign Gold' palette (`#0f172a` & `#b45309`) to reflect the gravity of the legal profession in Bangladesh. The site acts as a functional digital office, featuring a dynamic legal service filter, a real-time blog search for legal precedents, and a smart appointment booking system. Content is deeply localized, referencing specific Bangladeshi courts (Artha Rin Adalat, High Court Division) and regulatory bodies (RJSC, BIDA), ensuring it resonates with local corporate clients and individuals seeking serious counsel. The architecture prioritizes speed and clarity, utilizing Vanilla JS for all interactive elements to ensure seamless performance on mobile networks across Dhaka and Chittagong.",
      "liveLink": "https://twtech-hub.github.io/Vartex-Chamber-D4/",
      "techStack": [
        "HTML5 (Semantic Structure)",
        "Tailwind CSS (Utility-First Styling)",
        "Vanilla JavaScript (ES6+ Interactivity)",
        "Font Awesome (Iconography)",
        "Google Maps Embed API"
      ],
      "features": [
        "Smart Legal Service Filter: A JS-powered sorting engine allowing clients to instantly toggle between Corporate, Criminal, and Civil law services.",
        "Interactive Case Study Accordion: A 'Verdicts' section that reveals complex legal strategies and court outcomes without cluttering the UI.",
        "Real-Time Legal Blog Search: An instant-search feature for the 'Insights' page, helping users find articles on specific acts (e.g., 'Land Law', 'Divorce').",
        "Dynamic Booking Form: An appointment system that adapts its fields based on the selected legal area (e.g., asking for 'Company Name' only for Corporate clients).",
        "Attorney Profile Modals: A streamlined team section that opens detailed biographies in a modal overlay, keeping users on the main page."
      ],
      "designUnique": "The design philosophy is 'Statutory Authority.' We utilized the Cinzel typeface for headings to evoke the feel of engraved legal stationery, paired with Inter for modern readability. The 'Navy & Gold' theme was chosen to subconsciously signal 'Stability' and 'Excellence' to the Bangladeshi market, avoiding the 'startup' feel of bright colors.",
      "developmentProcess": "Developed with a 'Component-First' mindset using Vanilla JS. We built reusable logic for the modals, tabs, and accordions to keep the codebase lightweight (<15kb JS). The site is fully responsive, optimized for 4G mobile data, and follows strict semantic HTML guidelines for SEO ranking on terms like 'Law Firm Dhaka' and 'Supreme Court Lawyer'."
    },
    {
      "id": "lexicon-chambers",
      "title": "Lexicon Chambers & Partners",
      "category": "Law Firm",
      "image": "https://images.unsplash.com/photo-1589829085413-56de8ae18c73?q=80&w=2070",
      "shortDescription": "A digitally engineered fortress of legal authority for a premier Bangladeshi law firm.",
      "fullDescription": "Lexicon Chambers is an 8-page, 100+ section digital ecosystem designed to translate the weight and prestige of a traditional law firm into the digital age. Unlike generic templates, this project captures the 'Statutory Heritage' aesthetic required by high-end Bangladeshi advocates. It utilizes a 'Charcoal & Antique Gold' palette to signify stability and features a 'Merriweather' serif typography to evoke the feel of legal deeds. The site functions as a fully operational digital clerk: it includes a smart booking system that distinguishes between corporate and individual clients, a searchable library of Bangladeshi legal precedents, and an interactive map system guiding clients to their Motijheel headquarters. Built entirely on a Vanilla stack (HTML5/Tailwind/JS), it ensures lightning-fast load times even on mobile data networks in Dhaka courts, providing zero-latency access to bail numbers and case records.",
      "liveLink": "https://twtech-hub.github.io/Lexicon-Chamber-D5/",
      "techStack": [
        "HTML5 (Semantic & Accessible)",
        "Tailwind CSS (Utility-First Architecture)",
        "Vanilla JavaScript (ES6+ for Logic)",
        "Font Awesome 6 (Iconography)",
        "Google Maps Embed API (Dual Location)"
      ],
      "features": [
        "Smart Booking Engine: A dynamic form that alters input fields based on client type (Corporate vs. Individual), reducing administrative friction.",
        "Precedent Accordion: An interactive case result system that organizes complex High Court judgments into readable 'Challenge vs. Strategy' toggles.",
        "Live Search Library: A real-time filtering system for the legal blog, allowing users to instantly find articles on specific acts (e.g., 'Land Law', 'Divorce').",
        "Dual-Location Mapping: A tabbed interface allowing clients to switch views between the Head Chamber in Motijheel and the Supreme Court branch.",
        "Emergency Bail Ribbon: A contextual UI element providing immediate access to 24/7 criminal defense support, critical for the local market."
      ],
      "designUnique": "The design philosophy is 'Statutory Heritage.' We rejected modern minimalism for a 'Dense & Authoritative' layout. Textures of wood and parchment were subtly integrated using CSS overlays. The UI emphasizes hierarchy through heavy serif headings and gold accent lines, subconsciously signaling to the user that this firm has a history of winning in the Appellate Division.",
      "developmentProcess": "The project followed a 'Component-Based' Vanilla approach. We created reusable JS functions for modals, tabs, and accordions to keep the script weight under 15kb. Special attention was paid to the 'Print Styles' of the blog pages, ensuring legal articles could be printed cleanly for court reference. The entire site is valid HTML5 and scores 98/100 on Google Lighthouse for Performance and Accessibility."
    },
    {
      "id": "heritage-nexus-chamber",
      "title": "Heritage & Nexus Law Chamber",
      "category": "Law Firm",
      "image": "https://images.unsplash.com/photo-1505664194779-8beaceb93744?q=80&w=1000",
      "shortDescription": "A warm, high-end digital headquarters for a premier law chamber in Bangladesh.",
      "fullDescription": "The Heritage & Nexus Chamber website is a meticulously engineered 8-page digital ecosystem designed to reflect the prestige, tradition, and authority required by the Bangladeshi legal sector. Recognizing that legal decisions in Bangladesh are deeply rooted in trust and seniority, we abandoned the cold, generic corporate blue for a 'Rich Mahogany & Parchment' theme. This palette evokes the atmosphere of a historic Supreme Court library, instilling immediate confidence in potential clients. The platform serves as both a portfolio and a high-conversion tool, featuring custom-built interactive elements like a Legal Fee Estimator, dynamic Practice Area filters, and an automated Consultation Booking System. Every line of code is written in Vanilla JS to ensure lightning-fast performance even on limited mobile data connections, while the content is deeply localized to address specific Bangladeshi legal bodies such as RJSC, BIDA, and the Anti-Corruption Commission. The result is a website that doesn't just display services, but builds a bridge of empathy and expertise between the advocate and the seeker of justice.",
      "liveLink": "https://twtech-hub.github.io/Haritage-Chamber-D3/",
      "techStack": [
        "HTML5 Semantic Markup",
        "Tailwind CSS (JIT Engine via CDN)",
        "Vanilla JavaScript (ES6+)",
        "Lucide Icon Set",
        "Google Maps Embed API"
      ],
      "features": [
        "Interactive Legal Fee Estimator: A JS-powered budget tool that provides preliminary BDT estimates for various case types.",
        "Dynamic Practice Area Filter: An instant-sort UI that allows users to toggle between Civil, Criminal, and Corporate law without page reloads.",
        "Judgment Detail Accordions: A space-saving UI for the Case Results page that breaks down complex legal strategies and outcomes.",
        "High-Conversion Booking System: A multi-step consultation funnel with real-time success state feedback.",
        "Mobile-First Responsive Navigation: A persistsent navbar optimized for the heavy mobile-user demographic in Dhaka and Chittagong.",
        "Knowledge Base Integration: A blog/resource section tailored to local land law and regulatory compliance."
      ],
      "designUnique": "We adopted a 'Heritage & Prestige' philosophy. This involved a dual-font strategy: Playfair Display (Serif) for headlines to signal judicial authority, and Lato (Sans-serif) for body text to ensure modern readability. The color psychology utilizes #3d2b1f (Walnut) to ground the design in tradition, #c5a059 (Gold) to signify excellence, and #fdfbf7 (Parchment) to avoid the clinical feel of pure white, making the long legal descriptions easier on the eyes.",
      "developmentProcess": "Built entirely within the Vanilla ecosystem to maintain 100% control over the DOM and performance. We utilized Tailwind's utility-first classes to avoid external CSS bloat and implemented custom JS event listeners for the navigation and filtering logic. The project was developed iteratively, starting with a 12-section homepage designed for maximum social proof, followed by specialized pages that address the specific pain points of the Bangladeshi legal market, ensuring zero-bug functionality and a perfect lighthouse performance score."
    },
    {
  "id": "ironclad-chambers",
  "title": "IronClad Chambers: Barristers & Advocates",
  "category": "Legal Firm",
  "image": "https://images.unsplash.com/photo-1589829085413-56de8ae18c73?q=80&w=2070",
  "shortDescription": "A formidable, dark-themed digital fortress for an elite Bangladeshi law firm.",
  "fullDescription": "IronClad Chambers represents the pinnacle of legal authority in Bangladesh. Departing from traditional light themes, this project embraces an 'Obsidian & Gold' aesthetic to signal exclusivity, power, and high-stakes defense. The 8-page ecosystem is engineered for high-net-worth individuals and corporate entities who require absolute discretion and aggressive representation. It features a bespoke 'Dark Mode' interface with gold accents, a dynamic legal service filter, and a secure consultation booking engine. Every interaction, from the hover effects to the case study accordions, is designed to reinforce the firm's reputation as a tactical legal unit based in Gulshan. The technical stack prioritizes speed and security, utilizing lightweight Vanilla JS and semantic HTML5 to ensure optimal performance on Dhaka's mobile networks.",
  "liveLink": "https://twtech-hub.github.io/IronClad-Legal-Chamber-D6/",
  "techStack": [
    "HTML5 (Semantic Architecture)",
    "Tailwind CSS (Dark Mode Custom Config)",
    "Vanilla JavaScript (ES6+ Interactivity)",
    "Font Awesome 6 (Iconography)",
    "Google Maps Embed API (Grayscale Mode)"
  ],
  "features": [
    "Smart Booking Engine: A dual-path consultation form that adapts for Corporate vs. Individual clients, capturing relevant data like Trade License numbers.",
    "Interactive Case Archive: A 'Victories' page featuring an accordion-style breakdown of complex legal strategies used in the High Court Division.",
    "Real-Time Legal Intel Search: A client-side search engine for the blog, allowing users to instantly find analysis on specific acts (e.g., Digital Security Act).",
    "Emergency Bail Ticker: A persistent UI element providing immediate access to 24/7 criminal defense support.",
    "Attorney Bio Modals: An immersive overlay system for partner profiles, keeping users engaged without navigating away from the team page."
  ],
  "designUnique": "The design philosophy is 'Obsidian Authority.' We utilized a deep black and charcoal palette (`#050505` & `#121212`) to create a sense of depth and seriousness. Metallic gold accents (`#D4AF37`) are used sparingly to guide the eye to conversion points. The typography pairs 'Cinzel' (Serif) for headings to evoke statutory weight, with 'Manrope' (Sans) for modern readability.",
  "developmentProcess": "Built with a 'Component-First' Vanilla approach. We engineered custom JS functions for the mobile navigation, tab switching, and modal logic to maintain zero dependencies. The site is optimized for local Bangladeshi internet speeds, with lazy-loading images and a grayscale map filter to reduce visual noise. Accessibility standards (ARIA labels) were implemented for all interactive elements."
},
{
  "id": "vantage-legal",
  "title": "Vantage Legal: Barristers & Solicitors",
  "category": "Legal Firm",
  "image": "https://images.unsplash.com/photo-1486406146926-c627a92ad1ab?q=80&w=2070",
  "shortDescription": "A sleek, dark-themed digital fortress for a modern Bangladeshi law firm.",
  "fullDescription": "Vantage Legal is an 8-page, high-performance website designed to redefine the digital presence of legal professionals in Bangladesh. Moving away from traditional white-and-blue layouts, this project employs a 'Midnight Slate & Copper' palette to signify modern authority, luxury, and aggressive representation. It is engineered for high-net-worth individuals and corporate entities, featuring a smart consultation engine that adapts to client types, a searchable library of Bangladeshi legal precedents, and an interactive case archive. The site utilizes a 'Glassmorphism' dark mode aesthetic with high-contrast typography (Playfair Display & Outfit) to ensure readability while maintaining a cinematic feel. Fully responsive and built on a lightweight Vanilla JS stack, it ensures rapid loading even on mobile data networks across Dhaka.",
  "liveLink": "https://twtech-hub.github.io/Vintage-Legal-Chamber-D7/",
  "techStack": [
    "HTML5 (Semantic & Accessible)",
    "Tailwind CSS (Custom Dark Configuration)",
    "Vanilla JavaScript (ES6+ Interactivity)",
    "Font Awesome 6 (Iconography)",
    "Google Maps Embed API (Inverted Dark Mode)"
  ],
  "features": [
    "Smart Consultation Engine: A dynamic booking form that toggles fields for Corporate vs. Individual clients, capturing specific data like Trade License numbers.",
    "Interactive Case Archive: A 'Victories' page with an accordion-style breakdown of complex legal strategies used in the High Court Division.",
    "Real-Time Legal Intel Search: A client-side search engine for the blog, allowing users to instantly find analysis on specific acts (e.g., Digital Security Act).",
    "Emergency Bail Ticker: A persistent UI element providing immediate access to 24/7 criminal defense support.",
    "Attorney Bio Modals: An immersive overlay system for partner profiles, keeping users engaged without navigating away from the team page."
  ],
  "designUnique": "The design philosophy is 'Midnight Authority.' We utilized a palette of deep slate (`#0f172a`) and obsidian (`#020617`) to create depth, punctuated by metallic copper accents (`#b45309`) to guide user attention. This dark theme breaks the mold of traditional law firm sites, positioning Vantage Legal as a forward-thinking, formidable entity. New, high-resolution Unsplash imagery was curated to match this moody, high-stakes aesthetic.",
  "developmentProcess": "Built with a 'Component-First' Vanilla approach. We engineered custom JS functions for the mobile navigation, tab switching, and modal logic to maintain zero dependencies. The site is optimized for local Bangladeshi internet speeds, with lazy-loading images and a custom CSS filter for the map to match the dark theme perfectly. Accessibility standards were maintained despite the high-contrast dark mode."
},
    {
      "id": "sa-demo-1",
      "title": "Pathfinder Global",
      "category": "Education Consultancy",
      "image": "https://images.unsplash.com/photo-1523240795612-9a054b0db644?q=80&w=1000",
      "shortDescription": "Lead-conversion engine for study abroad aspirants.",
      "fullDescription": "A high-performance recruitment portal for international students. It features a split-hero layout with a floating lead form and a dynamic partner university logo marquee for instant credibility.",
      "liveLink": "https://techwisdom-study-abroad-demo-1.netlify.app/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "AOS.js"
      ],
      "features": [
        "Dynamic Hero Marquee",
        "Interactive Consultation Form",
        "Service Cards with Icon Hover",
        "Scroll-Reveal Animations"
      ],
      "designUnique": "Utilized a 'Professional Blue' palette with sharp, corporate edges to convey trust and academic reliability.",
      "developmentProcess": "Implemented asynchronous loading for the university marquee to ensure zero impact on page load speed."
    },
    {
      "id": "vortex-digital",
      "title": "Vortex Digital",
      "category": "Digital Agency",
      "image": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=1000",
      "shortDescription": "Cyber-industrial portfolio for a high-performance ad agency.",
      "fullDescription": "An 8-page 'Cyber-Industrial' agency website designed for high-growth Bangladeshi brands. Features a command-center aesthetic with glitch effects, live ROI calculators, and a tactical service matrix, wrapped in a 'Deep Carbon & Neon Lime' dark mode.",
      "liveLink": "https://twtech-hub.github.io/VORTEX.-Digital-Agency-D2/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "Canvas API"
      ],
      "features": [
        "Live Ad Budget Simulator",
        "Holo-Tab Service Matrix",
        "Glitch-Reveal Team Cards",
        "Command-Line Resource Search"
      ],
      "designUnique": "Utilized a 'Deep Carbon' (#09090b) background with 'Neon Lime' (#ccff00) accents, featuring a custom cursor and monospaced typography to simulate a high-tech tactical interface.",
      "developmentProcess": "Implemented vanilla JS for the complex 'Budget Allocator' logic and used the HTML5 Canvas API for the 'Matrix Rain' effect to ensure high performance without heavy libraries."
    },
    {
      "id": "synapse-systems",
      "title": "Synapse Systems",
      "category": "Digital Agency",
      "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?q=80&w=1000",
      "shortDescription": "Algorithmic marketing portfolio with SaaS-style architecture.",
      "fullDescription": "An 8-page 'Quantum Tech' agency website designed to look like a high-end software dashboard. It features a developer-docs style resource hub, a 'Tech Radar' visualization, and a 'Resource Allocator' calculator, wrapped in a 'Midnight Navy & Plasma Blue' aesthetic.",
      "liveLink": "https://twtech-hub.github.io/SYNAPSE.SYS-Digital-System-D3/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "Canvas API"
      ],
      "features": [
        "Grid Torch Cursor Effect",
        "Interactive Tech Radar",
        "Resource Allocator Calculator",
        "Documentation-Style Blog"
      ],
      "designUnique": "Adopted a 'Digital Grid' philosophy using JetBrains Mono typography, glassmorphism panels, and a reactive background grid to appeal to tech-savvy founders.",
      "developmentProcess": "Engineered a custom 'ScrollSpy' navigation for the services page and a vanilla JS 'Torch' effect to simulate a dynamic lighting system on the grid background."
    },
    {
      "id": "lumina-creative",
      "title": "Lumina Creative",
      "category": "Digital Agency",
      "image": "https://images.unsplash.com/photo-1550745165-9bc0b252726f?q=80&w=1000",
      "shortDescription": "Vibrant, artistic portfolio for a high-energy creative agency.",
      "fullDescription": "An 8-page 'Prismatic Pop' agency website designed to stand out in the Bangladeshi market. Features include a chameleon background that shifts colors, a masonry grid portfolio, and a 'Vibe Meter' for team culture, all wrapped in a 'Royal Purple & Solar Orange' aesthetic.",
      "liveLink": "https://twtech-hub.github.io/LUMINA.-Digital-Marketing-D4/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "CSS Gradients"
      ],
      "features": [
        "Chameleon Background Effect",
        "Masonry Grid Gallery",
        "Interactive Vibe Meter",
        "Floating Input Animations"
      ],
      "designUnique": "Utilized a 'Prismatic Pop' philosophy with deep purple backgrounds and vibrant gradients (Solar Orange, Laser Pink) to convey high energy and artistic flair.",
      "developmentProcess": "Implemented a vanilla JS scroll listener to dynamically change the background gradient based on the active section, creating an immersive 'chameleon' effect without heavy libraries."
    },
    {
      "id": "nexus-growth",
      "title": "Nexus Growth Agency",
      "category": "Digital Agency",
      "image": "https://images.unsplash.com/photo-1460925895917-afdab827c52f?q=80&w=1000",
      "shortDescription": "High-performance digital agency portfolio with ROI tools.",
      "fullDescription": "A 7-page 'Neo-Minimalist' agency website designed for the Bangladeshi market. Features include an interactive service ecosystem, real-time ad budget ROI calculator, and a dynamic case study filtering system, all wrapped in a 'Frost & Indigo' glassmorphism aesthetic.",
      "liveLink": "https://twtech-hub.github.io/NEXUS-GROWTH.-Digital-D1/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "FontAwesome"
      ],
      "features": [
        "Real-Time Ad ROI Calculator",
        "Interactive Service Stack Tabs",
        "Masonry Case Study Grid",
        "Smart Office Map Switcher"
      ],
      "designUnique": "Utilized a 'Neo-Minimalist' philosophy with Frost White backgrounds and Indigo accents (#4f46e5) to signal high-tech performance and data precision.",
      "developmentProcess": "Built custom vanilla JS modules for the pricing toggles and ROI logic to ensure instant interactivity without heavy framework overhead."
    },
    {
      "id": "sa-demo-2",
      "title": "ScholarGate",
      "category": "Education Consultancy",
      "image": "https://kennedyeducation.com/wp-content/uploads/2021/04/banner-m.jpg",
      "shortDescription": "Information-rich university exploration dashboard.",
      "fullDescription": "Demo 2 focuses on data density. It provides detailed country guides and an interactive university search bar, designed for students in the deep research phase of their application.",
      "liveLink": "https://techwisdom-study-abroad-demo-2.netlify.app/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "Typed.js"
      ],
      "features": [
        "Typed.js Search Integration",
        "Comprehensive Country Grids",
        "Scholarship Availability Badges",
        "Multi-Branch Footer Navigation"
      ],
      "designUnique": "Academic minimalist style using 'Scholar Gold' accents on a crisp, bright layout for readability.",
      "developmentProcess": "Created a lightweight JavaScript object-search to filter through country categories instantly."
    },
    {
      "id": "sa-demo-3",
      "title": "VisaBridge",
      "category": "Education Consultancy",
      "image": "https://images.unsplash.com/photo-1544027993-37dbfe43562a?q=80&w=1000",
      "shortDescription": "Logistics hub for visa processing and document vetting.",
      "fullDescription": "This portal simplifies the complex document chain required for global visas. It features interactive roadmaps, document checklists, and embassy interview resources.",
      "liveLink": "https://twtech-hub.github.io/Sonar-Bangla-Education-Consultancy-D4/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Step-by-Step Roadmap UI",
        "Interactive Document Checklists",
        "Embedded Google Maps Locator",
        "Process FAQ Accordions"
      ],
      "designUnique": "Instructional design style using 'Safety Teal' to reduce student anxiety throughout the legal process.",
      "developmentProcess": "Developed a custom accordion system in vanilla JS to manage heavy information without vertical clutter."
    },
    {
      "id": "sa-demo-4",
      "title": "GlobalLife Student Hub",
      "category": "Education Consultancy",
      "image": "https://blog.adventus.io/hs-fs/hubfs/image%201.png?width=2101&height=1051&name=image%201.png",
      "shortDescription": "Community-focused pre-departure portal.",
      "fullDescription": "Demo 4 focuses on student lifestyle after landing. It covers student alumni networks, job hunting tips, and accommodation search in a vibrant, community-first layout.",
      "liveLink": "https://techwisdom-study-abroad-demo-4.netlify.app/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Alumni Success Grid",
        "WhatsApp Chat Routing",
        "Pre-departure Toolkits",
        "Student Life Video Hub"
      ],
      "designUnique": "Vibrant and energetic design using rounded corners and warm gradients to appeal to the Gen-Z demographic.",
      "developmentProcess": "Optimized mobile navigation for a 'one-thumb' user experience, prioritizing instant social connectivity."
    },
    {
      "id": "traffic-matrix",
      "title": "Traffic Matrix",
      "category": "Digital Agency",
      "image": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=1000",
      "shortDescription": "Neo-Brutalist, high-contrast portfolio for a performance marketing agency.",
      "fullDescription": "A 7-page 'Neo-Brutalist' website that rejects modern design trends for a raw, high-conversion aesthetic. Featuring sharp borders, high-contrast colors (Yellow/Black), and utilitarian interactions, it is designed for agencies that focus purely on ROI and Sales data.",
      "liveLink": "https://twtech-hub.github.io/TRAFFICMATRIX-Digital-D6/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript",
        "CSS Filters"
      ],
      "features": [
        "ROAS Calculator",
        "Terminal-Style Interactions",
        "Confidential Case File Modals",
        "Glitch Text Effects"
      ],
      "designUnique": "Utilizes a 'Anti-Design' philosophy with 0px border radius, thick 3px outlines, and hard shadows to convey a 'no-nonsense' approach to business.",
      "developmentProcess": "Implemented vanilla JS for raw, snappy tab switching and a typewriter effect for form submission to mimic a command-line interface."
    },
    {
      "id": "re-demo-1",
      "title": "Canvas Real Estate",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1512917774080-9991f1c4c750?q=80&w=1000",
      "shortDescription": "Art-gallery inspired property marketplace.",
      "fullDescription": "Canvas treats every home as a masterpiece. It uses high whitespace and oversized typography to create a sophisticated architectural feel.",
      "liveLink": "https://twtech-hub.github.io/Canvas-Real-Estate-D1/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Gallery-Style Property Cards",
        "Oversized Visual Headers",
        "Architectural Detail Tabs",
        "Minimalist Grid System"
      ],
      "designUnique": "Blank slate philosophy: Pure white backgrounds with charcoal typography to let property photos dominate.",
      "developmentProcess": "Utilized advanced CSS grid systems to create a non-uniform masonry layout for visually striking previews."
    },
    {
      "id": "re-demo-2",
      "title": "UrbanAddress",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1486406146926-c627a92ad1ab?q=80&w=1000",
      "shortDescription": "Connectivity-first urban search engine.",
      "fullDescription": "Focused on the practicalities of Dhaka living, UrbanAddress highlights metro rail access, commute efficiency, and neighborhood safety rankings.",
      "liveLink": "https://twtech-hub.github.io/UrbanAddress-BD-Real-Estate-D2/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Commute-Time Search Logic",
        "Metro Station Proximity Filter",
        "Neighborhood Safety Badges",
        "Simplified Property Listings"
      ],
      "designUnique": "Corporate efficiency design using 'Transit Blue' and high-readability sans-serif fonts.",
      "developmentProcess": "Built a JavaScript sorting engine that prioritizes listings based on coordinate proximity to business hubs."
    },
    {
      "id": "re-demo-3",
      "title": "Vista Properties",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1512918728675-ed5a9ecdebfd?q=80&w=1000",
      "shortDescription": "Scenic and panoramic property showcase.",
      "fullDescription": "Vista focuses on the 'View-First' experience. It prioritizes penthouses, lake-facing units, and high-rise panoramic apartments with an immersive UI.",
      "liveLink": "https://twtech-hub.github.io/Vista-Properties-D3/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Full-Bleed Visual Sections",
        "Sunlight Exposure Data",
        "Panoramic Video Backgrounds",
        "Site-Visit Booking Module"
      ],
      "designUnique": "Immersive frameless design where every image stretches the full width of the browser.",
      "developmentProcess": "Applied CSS aspect-ratio hacks to maintain panoramic scale across mobile and desktop screens."
    },
    {
      "id": "re-demo-4",
      "title": "Greenleaf Estate",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1448630360428-65456885c650?q=80&w=1000",
      "shortDescription": "Sustainable and eco-conscious housing portal.",
      "fullDescription": "The green-standard for real estate in Bangladesh. It emphasizes energy efficiency, vertical gardens, and LEED-certified building standards.",
      "liveLink": "https://twtech-hub.github.io/GreenLeaf-Estate-D4/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Energy Efficiency Rating Filter",
        "Solar Potential Calculator",
        "Green-Space Percentage View",
        "Sustainability Audit Badges"
      ],
      "designUnique": "Organic Modernism using a palette of Sage Green, Charcoal, and Off-White.",
      "developmentProcess": "Created a custom 'Eco-Meter' JS logic that visualizes long-term utility savings per property."
    },
    {
      "id": "re-demo-5",
      "title": "Nexus Real Estate",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1497366216548-37526070297c?q=80&w=1000",
      "shortDescription": "Smart-home and tech-ready living portal.",
      "fullDescription": "Nexus targets tech-savvy professionals. Listings focus on IoT readiness, fiber optics, and automated building management systems.",
      "liveLink": "https://twtech-hub.github.io/Nexus-Properties-LTD-D5/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Home Automation Checklist",
        "Smart-Tech Capability Badges",
        "Interactive Tech-Plan Viewer",
        "High-Speed Connectivity Stats"
      ],
      "designUnique": "High-tech aesthetic with sharp edges, deep grays, and neon-emerald accents.",
      "developmentProcess": "Built an interactive 'Smart-Feature' toggle that changes floorplan visuals to show gadget placement."
    },
    {
      "id": "re-demo-6",
      "title": "Urban Elite",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1600566753376-12c8ab7fb75b?q=80&w=1000",
      "shortDescription": "Luxury villa and gated community portal.",
      "fullDescription": "Urban Elite focuses on horizontal living: private villas, duplexi, and secured gated estates with high-level amenity analysis.",
      "liveLink": "https://twtech-hub.github.io/UrbanElite-Real-Estate-D6/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Amenity Spotlight Interaction",
        "Security Grade Visualization",
        "Private Land Title Verification",
        "VIP Concierge Booking Form"
      ],
      "designUnique": "Prestigious Navy-and-Gold color scheme with large, elegant serif typography.",
      "developmentProcess": "Coded a 'Gated' content section that requires lead-capture to view specific community map details."
    },
    {
      "id": "re-demo-7",
      "title": "Nogor Real Estate",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1595526114035-0d45ed16cfbf?q=80&w=1000",
      "shortDescription": "Affordable housing and apartment hub.",
      "fullDescription": "Focused on the middle-income segment in Uttara, Mirpur, and Bashundhara. Prioritizes bank-loan projects and easy installment plans.",
      "liveLink": "https://twtech-hub.github.io/Bricks-Beams-Real-Estate-D9/et",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Installment Plan Generator",
        "Loan Eligibility Wizard",
        "Ready-to-Move Filter",
        "Local Area-wise Pricing Tool"
      ],
      "designUnique": "Warm, approachable UI using local cultural tones and high-readability layout.",
      "developmentProcess": "Implemented a simplified mortgage calculator using a 'Single-Field' entry for mass-market accessibility."
    },
    {
      "id": "re-demo-8",
      "title": "Legacy Holding",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1560518883-ce09059eeffa?q=80&w=1000",
      "shortDescription": "Trust-centric corporate real estate portal.",
      "fullDescription": "A platform for long-term investors. It focuses on freehold land and heritage properties with massive appreciation potential and clean titles.",
      "liveLink": "https://twtech-hub.github.io/Legacy-Holding-limited-D8/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Historical Appreciation Charts",
        "Title Deed Verification Desk",
        "Joint Venture Analysis Hub",
        "Investor Portfolio Tracker"
      ],
      "designUnique": "Stable corporate aesthetic with heavy borders and emerald tones to convey permanent value.",
      "developmentProcess": "Built a specialized 'Audit Timeline' that shows the legal progress of properties in real-time."
    },
    {
      "id": "re-demo-9",
      "title": "Brick & Beams",
      "category": "Real Estate",
      "image": "https://media.istockphoto.com/id/2006238006/photo/real-estate-agent-showing-a-new-home-to-prospective-buyers.jpg?s=612x612&w=0&k=20&c=_jRsxLqVVyWMRS8-JxvhetdAgk5crzOQS55JLCElMzI=",
      "shortDescription": "Technical and structural project showcase.",
      "fullDescription": "Focused on construction quality. It provides deep-dives into materials used, beam strength, and finish standards for engineering-conscious buyers.",
      "liveLink": "https://twtech-hub.github.io/Bricks-Beams-Real-Estate-D9/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Before/After Build Slider",
        "Material Specification Breakdown",
        "Structural Safety Badges",
        "Site-Log Video Integration"
      ],
      "designUnique": "Blueprint-inspired UI with grid-line backgrounds and technical monospaced fonts.",
      "developmentProcess": "Developed a custom vanilla JS slider to visualize the layering of building finishes (Raw to Ready)."
    },
    {
      "id": "re-demo-10",
      "title": "MetroSpace",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1497366754035-f200968a6e72?q=80&w=1000",
      "shortDescription": "Dhaka Metro Rail-centric property portal.",
      "fullDescription": "Capitalizing on the new transit infrastructure. MetroSpace helps users find properties within walking distance of any Metro station.",
      "liveLink": "https://twtech-hub.github.io/MetroSpace-Real-Estate-D10/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "MRT Station-Proximity Engine",
        "Walking-Time Estimation Logic",
        "ROI Comparison Map",
        "Transit-Connected Badges"
      ],
      "designUnique": "Modern transit-style UI with 'Signal Green' highlights and fast-paced layout.",
      "developmentProcess": "Scripted a coordinate-based logic that calculates walking time between listings and the nearest MRT exit."
    },
    {
      "id": "re-demo-11",
      "title": "Onyx Realty",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1497366216548-37526070297c?q=80&w=1000",
      "shortDescription": "Elite dark-mode penthouse portal.",
      "fullDescription": "A boutique agency portal for the top 1% of the market. Onyx focuses on bespoke penthouses, private elevators, and diplomatic zone listings.",
      "liveLink": "https://twtech-hub.github.io/Onyx-Realty-D11/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Privacy-Shield Pricing Logic",
        "Private Viewing Concierge",
        "Cinematic Section Reveals",
        "Expat Document Support Desk"
      ],
      "designUnique": "Bold black-on-black aesthetic with 'Onyx Gold' highlights and deep drop-shadows.",
      "developmentProcess": "Used the Intersection Observer API to create a cinematic 'fade-and-scale' reveal for property headers."
    },
    {
      "id": "re-demo-12",
      "title": "Urban Void",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?q=80&w=1000",
      "shortDescription": "Avant-garde minimalist dark-mode real estate.",
      "fullDescription": "The pinnacle of dark luxury. Urban Void uses 'Negative Space' as a primary element, making property photography feel curated and elite.",
      "liveLink": "https://twtech-hub.github.io/UrbanVoid-Real-Estate-D12/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Zinc-Cyan Palette Integration",
        "Dynamic BDT Mortgage Engine",
        "Via Dalil Chain Visualizer",
        "Registration Fee Calculator"
      ],
      "designUnique": "Pure Zinc-950 background with Electric Cyan accents. Minimalist text, high-impact visuals.",
      "developmentProcess": "Developed a custom BDT calculation engine for registration fees based on current government tax SROs."
    },
    {
      "id": "re-demo-13",
      "title": "Zenith Estates",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1600607687939-ce8a6c25118c?q=80&w=1000",
      "shortDescription": "Light-minimalist luxury life-style portal.",
      "fullDescription": "Zenith focuses on 'Organic Luxury'. It features high-trust legal vetting, a sand-and-terracotta palette, and sophisticated editorial guides.",
      "liveLink": "https://twtech-hub.github.io/Zenith-Holding-Limited-D13/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Live Interest Rate Ticker",
        "50% DBR Eligibility Checker",
        "Document Checklist Switcher",
        "Construction Progress Tracking"
      ],
      "designUnique": "Editorial magazine layout using warm natural tones and high-end serif typography.",
      "developmentProcess": "Implemented a scroll-based construction progress visualizer using pure CSS transitions and JS observers."
    },
    {
      "id": "re-demo-14",
      "title": "Aura Realty",
      "category": "Real Estate",
      "image": "https://images.unsplash.com/photo-1512917774080-9991f1c4c750?q=80&w=1000",
      "shortDescription": "Organic modernism in property management.",
      "fullDescription": "Aura Realty blends urban life with nature. Designed for modern buyers who prioritize eco-ethics, clean aesthetics, and sustainable luxury.",
      "liveLink": "https://twtech-hub.github.io/AuraRealty-D14/",
      "techStack": [
        "HTML5",
        "Tailwind CSS",
        "JavaScript"
      ],
      "features": [
        "Organic Scroll Reveal Tech",
        "ROI Projection Growth Engine",
        "Via Dalil Chain Visualizer",
        "Branch Navigation Map"
      ],
      "designUnique": "Utilizes large 60px border-radii, forest green accents, and a pearl-white backdrop.",
      "developmentProcess": "Scripted a 5-year capital growth calculator in JS based on neighborhood-specific historical growth data."
    }
  ]